app/views/shared/_abouts.html.erb

SELECT 1 AS one FROM "headers" LIMIT $1  [["LIMIT", 1]]
---

        <% if Header.exists? %>

SELECT 1 AS one FROM "abouts" LIMIT $1  [["LIMIT", 1]]
---

        <% if About.exists? %>

SELECT 1 AS one FROM "headers" LIMIT $1  [["LIMIT", 1]]
---
<!-- to update to abtsheaderimg at headers -->
            <% if Header.exists? %>