app/views/shared/_abouts2.html.erb

SELECT 1 AS one FROM "abouts" LIMIT $1  [["LIMIT", 1]]
---
    <!-- aboutus-section -->
<% if About.exists? %>