app/views/shared/_blogs.html.erb

SELECT 1 AS one FROM "headers" LIMIT $1  [["LIMIT", 1]]
---
      <div class="col-md-12">
        <% if Header.exists? %>

SELECT 1 AS one FROM "blogs" LIMIT $1  [["LIMIT", 1]]
---
        <!-- featured-imagebox-blog -->
        <% if Blog.exists? %>