app/views/shared/_board.html.erb

SELECT 1 AS one FROM "boards" LIMIT $1  [["LIMIT", 1]]
---
    <% if Board.exists? %>