app/views/shared/_features.html.erb

SELECT 1 AS one FROM "headers" LIMIT $1  [["LIMIT", 1]]
---
        <div class="row no-gutters">
          <% if Header.exists? %>

SELECT 1 AS one FROM "headers" LIMIT $1  [["LIMIT", 1]]
---
                            <!-- section title -->
                            <% if Header.exists? %>

SELECT 1 AS one FROM "features" LIMIT $1  [["LIMIT", 1]]
---

                            <% if Feature.exists? %>