app/views/shared/_loanbody.html.erb

      </div>
      <% if Package.exists? %>
---
SELECT 1 AS one FROM "packages" LIMIT $1  [["LIMIT", 1]]