app/views/shared/_plans.html.erb

      <div class="col-md-12">
        <% if Header.exists? %>
---
SELECT 1 AS one FROM "headers" LIMIT $1  [["LIMIT", 1]]

        <!-- featured-imagebox-blog -->
        <% if Plan.exists? %>
---
SELECT 1 AS one FROM "plans" LIMIT $1  [["LIMIT", 1]]