app/views/shared/_services.html.erb


        <% if Header.exists? %>
---
SELECT 1 AS one FROM "headers" LIMIT $1  [["LIMIT", 1]]

              <div class="history-slide owl-carousel" data-item="4" data-nav="false" data-dots="false" data-auto="true">
                <% if Service.exists? %>
---
SELECT 1 AS one FROM "services" LIMIT $1  [["LIMIT", 1]]