app/views/shared/_transactions.html.erb


              <% if Transaction.where(user_id: current_user.id).exists? %>
---
SELECT 1 AS one FROM "transactions" WHERE "transactions"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]