app/views/shared/_transactions.html.erb

            <%# ── Wire Transfers ── %>
            <% if Transfer.where(user_id: current_user.id).exists? %>
---
SELECT 1 AS one FROM "transfers" WHERE "transfers"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

            <%# ── Transactions ── %>
            <% if Transaction.where(user_id: current_user.id).exists? %>
---
SELECT 1 AS one FROM "transactions" WHERE "transactions"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

            <%# ── Empty state ── %>
            <% unless Transfer.where(user_id: current_user.id).exists? || Transaction.where(user_id: current_user.id).exists? %>
---
SELECT 1 AS one FROM "transactions" WHERE "transactions"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "transfers" WHERE "transfers"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]