app/views/loans/userorder.html.erb

          <p style="font-size:11px; font-weight:700; color:#8a9bbf; letter-spacing:1.5px; text-transform:uppercase; margin:0 0 4px;">Active Loans</p>
          <% if Loan.where(user_id: current_user.id).exists? %>
---
SELECT 1 AS one FROM "loans" WHERE "loans"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

        <tbody>
          <% if Loan.where(user_id: current_user.id).exists? %>
---
SELECT 1 AS one FROM "loans" WHERE "loans"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]