app/views/cards/index.html.erb

SELECT 1 AS one FROM "cards" WHERE "cards"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    <div class="row justify-content-center">
      <% if Card.where(user_id: current_user.id).exists? %>

SELECT 1 AS one FROM "cards" WHERE "cards"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
                <tbody>
                  <% if Card.where(user_id: current_user.id).exists? %>