app/controllers/accounts_controller.rb

    def index
      @users = User.where(user_id: current_user)
      @plans = Plan.all
      @transactions = Transaction.where(user_id: current_user).order('created_at DESC')
      @transfers = Transfer.where(user_id: current_user).order('created_at DESC')
      @accounts = Account.where(user_id: current_user).order('created_at ASC')
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]

    def new
      @plans = Plan.all
---
SELECT "plans".* FROM "plans"

    def create
      @account = current_user.accounts.build(account_params)
      if @account.save
        user = User.find_by_id(@account.user_id)
---
INSERT INTO "accounts" ("address", "zip_code", "ssn", "mmn", "account_pin", "account_number", "routine_number", "slug", "balance", "occupation_address", "user_id", "created_at", "updated_at", "status", "state", "city", "phone") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def edit
      @plans = Plan.all
---
SELECT "plans".* FROM "plans"

      def find_account
        @account = Account.friendly.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]