app/controllers/cards_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
      def index
        @users = User.where(user_id: current_user)
        @cards = Card.where(user_id: current_user).order('created_at DESC')
        @accounts = Account.where(user_id: current_user).order('created_at ASC')