app/controllers/deposits_controller.rb

SELECT "deposits".* FROM "deposits" WHERE "deposits"."user_id" = $1 ORDER BY created_at ASC  [["user_id", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]
---
  def index
    @users = User.where(user_id: current_user)
    @plans = Plan.all
    @transactions = Transaction.where(user_id: current_user).order('created_at DESC')
    @transfers = Transfer.where(user_id: current_user).order('created_at DESC')
    @deposits = Deposit.where(user_id: current_user).order('created_at ASC')
    @accounts = Account.where(user_id: current_user).order('created_at ASC')