app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.where(user_id: current_user).order('created_at DESC')
    @accounts = Account.where(user_id: current_user).order('created_at DESC')
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]