app/controllers/welcomes_controller.rb

SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
SELECT "headers".* FROM "headers"
---
  def index
    @welcomes = Welcome.all
    @headers = Header.all