app/views/transactions/index.html.erb

            <p style="font-size:11px; font-weight:700; color:#8a9bbf; letter-spacing:1.5px; text-transform:uppercase; margin:0 0 6px;">Total Transactions</p>
            <h3 style="font-family:'Playfair Display',Georgia,serif; font-size:36px; color:#0a1628; font-weight:700; margin:0 0 10px;"><%= Transaction.where(user_id: current_user.id).count %></h3>
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]