app/views/layouts/accounts.html.erb

SELECT 1 AS one FROM "accounts" WHERE "accounts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---

  <% if Account.where(user_id: current_user.id).exists?%>