app/views/layouts/application.html.erb

SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
---
<head>
  <%  @welcomes = Welcome.all  %>