app/views/layouts/devise.html.erb

SELECT "welcomes".* FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
---
<head>
  <%  @welcomes = Welcome.all  %>

SELECT 1 AS one FROM "welcomes" LIMIT $1  [["LIMIT", 1]]
---
                          <div class="px-3">
                            <% if Welcome.exists? %>