app/views/accounts/_topbox.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY created_at ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 2]]
---
          <i class="mdi mdi-bank-outline" style="font-size:13px; margin-right:4px;"></i>
          <%= Account.where(user_id: current_user.id).count %> active account(s)