app/views/accounts/index.html.erb


  <% if Account.where(user_id: current_user.id).exists? %>
---
SELECT 1 AS one FROM "accounts" WHERE "accounts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

                            <!--end col-->
                            <div class="col-4">  <h4><%= Account.where(user_id: current_user.id).count %>
.</h4></div>
---
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]