app/views/accounts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      </div>
      <h4 style="font-family:'Playfair Display',Georgia,serif; font-size:20px; color:#fff; font-weight:700; margin:0 0 4px;"><%= @account.user.first_name %> <%= @account.user.last_name %></h4>

SELECT "accounts".* FROM "accounts" WHERE "accounts"."slug" = $1 LIMIT $2  [["slug", "3682243101"], ["LIMIT", 1]]
---
      <div style="padding:8px 24px 16px;">
        <% [
          ["Home Address",       @account.address],
          ["Occupation Address", @account.occupation_address],
          ["Country",            @account.country],
          ["Zip Code",           @account.zip_code],
          ["Date of Birth",      @account.dob],
          ["Account Slug",       @account.slug]
        ].each do |label, value| %>